<a href="https://colab.research.google.com/github/nikhilbordekar/SQL-Practice/blob/main/SQL_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Nikhil Bordekar's Notes**

## SQL CREATE TABLE STATEMENT:

The SQL CREATE TABLE statement is used to define and create a new table in a relational database. This statement specifies the table's name and the structure of its columns. The general syntax for creating a table is as follows:

```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    ...
    columnN datatype
);
```

Example:

Let's create a simple table named "Employees" with columns for employee information:

```sql
CREATE TABLE Employees (
    EmployeeID INT,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Email VARCHAR(100),
    HireDate DATE
);
```


## SQL INSERT INTO STATEMENT:

The SQL INSERT INTO statement is used to insert new records or rows into an existing table in a relational database. You specify the table where the data should be inserted and provide the values or data for each column in the table. The general syntax for the INSERT INTO statement is as follows:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```
Now, let's insert a new employee into the "Employees" table:
```sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Email, HireDate)
VALUES (3, 'Alice', 'Williams', 'alice.w@email.com', '2023-03-10');
```

## ALTER TABLE STATEMENT (TO CHANGE COLUMN NAME)

To change the name of a column in an SQL table, you can use the ALTER TABLE statement with the RENAME COLUMN clause. The specific syntax can vary slightly depending on the database management system (DBMS) you are using. Below, I'll provide a general example using standard SQL syntax:

```sql
ALTER TABLE table_name
CHANGE COLUMN old_column_name new_column_name data_type;
```
Example:

Suppose you have a table named "Employees" with a column named "EmployeeLastName," and you want to change it to "EmployeeSurname." You can use the following SQL statement:

```sql
ALTER TABLE Employees
CHANGE COLUMN EmployeeLastName EmployeeSurname VARCHAR(50);

```

##`SELECT` & `WHERE`

In SQL, the SELECT and WHERE clauses are fundamental components used for filtering and selecting data from a database
```sql
SELECT first_name, last_name
FROM employees
WHERE department = 'HR' AND salary > 50000;
```
In this example, the SELECT clause specifies the columns (first_name and last_name) to be included in the result set. The WHERE clause filters the rows, ensuring that only employees in the 'HR' department with a salary greater than 50,000 are selected.

These clauses are essential for retrieving specific data from a database, enabling you to tailor your query results to your precise requirements.

## UPDATE STATEMENET (TO UPDATE VALUE IN THE COLUMN)


To change the values in a column of an SQL table, you can use the UPDATE statement. The UPDATE statement allows you to modify existing data in a table based on a specified condition. Here's the basic syntax for updating values in a column:

```sql
UPDATE table_name
SET column_name = new_value
WHERE condition;
```
Example:

Suppose you have a table named "Students" with a column "Grade," and you want to update the grade of a specific student with ID 123 to 'A'. You can use the following SQL statement:

```sql
UPDATE Students
SET Grade = 'A'
WHERE StudentID = 123;
```

## DELETE, TRUNCATE & DROP

## 1.DELETE:

Definition: The DELETE statement is **used to remove specific rows** from a table based on a specified condition. It's a data manipulation language (DML) command.

Syntax:
```sql
DELETE FROM table_name
WHERE condition;
```
Example: Suppose you have a table named "Employees," and you want to delete the employee with an ID of 101.
```sql
DELETE FROM Employees
WHERE EmployeeID = 101;
```

## 2.TRUNCATE

Definition: The TRUNCATE statement is **used to remove all the rows from a table** while keeping the table structure intact. It's also a DDL command.

Syntax:
```sql
TRUNCATE TABLE table_name;
```
Example: To remove all rows from the "Students" table while keeping the table structure, you can use:
```sql
TRUNCATE TABLE Students;
```

## 3.DROP

Definition: The DROP statement is **used to delete an entire table or database** object, including all the data, indexes, and constraints. It's a data definition language (DDL) command.

Syntax:

1. To drop a table:

```sql
DROP TABLE table_name;
```
  EXAMPLE:
```sql
DROP TABLE Employees;
```
2. To drop a database:

```sql
DROP DATABASE database_name;
```
  EXAMPLE:
```sql
DROP DATABASE KPMG;
```

## `AGGREGATE FUNCTIONS`

Here are examples of how to use `COUNT`, `SUM`, `MAX`, `GROUP BY`, and `HAVING` to aggregate data using SQL code:

Let's say we have a table named `orders` with the following columns: `order_id`, `customer_id`, `order_date`, and `total_amount`.

1. **COUNT**: To count the number of orders for each customer:

```sql
SELECT customer_id, COUNT(order_id) AS order_count
FROM orders
GROUP BY customer_id;
```

2. **SUM**: To calculate the total amount spent by each customer:

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id;
```

3. **MAX**: To find the highest order amount for each customer:

```sql
SELECT customer_id, MAX(total_amount) AS max_order_amount
FROM orders
GROUP BY customer_id;
```

4. **GROUP BY**: To group the results by a specific column (e.g., `order_date`) and then aggregate:

```sql
SELECT order_date, COUNT(order_id) AS order_count, SUM(total_amount) AS total_spent
FROM orders
GROUP BY order_date;
```

5. **HAVING**: To filter the results of a grouped query based on an aggregate condition (e.g., customers who have spent more than $1,000):

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id
HAVING SUM(total_amount) > 1000;
```

In this example, the `HAVING` clause filters the results to include only those customers whose total spending (`SUM(total_amount)`) is greater than $1,000.

These SQL queries demonstrate how to use aggregate functions (`COUNT`, `SUM`, `MAX`) along with `GROUP BY` and `HAVING` to analyze and summarize data in a database.

## `DISTINCT`

Let's assume we have a table named `employees` with the following columns: `employee_id`, `first_name`, `last_name`, and `department`.

1. **DISTINCT**: To retrieve a distinct list of departments:

```sql
SELECT DISTINCT department
FROM employees;
```

This query will return a list of unique department names from the `employees` table.

2. **COUNT DISTINCT**: To count the number of distinct departments:

```sql
SELECT COUNT(DISTINCT department) AS distinct_department_count
FROM employees;
```

This query will return the count of unique department names in the `employees` table.

3. **DISTINCT with Multiple Columns**: To get distinct combinations of `first_name` and `last_name`:

```sql
SELECT DISTINCT first_name, last_name
FROM employees;
```

This query will return a list of unique combinations of first names and last names from the `employees` table.

4. **COUNT DISTINCT with Multiple Columns**: To count the number of distinct employee combinations (first name and last name):

```sql
SELECT COUNT(DISTINCT first_name, last_name) AS distinct_employee_count
FROM employees;
```

This query will return the count of unique combinations of first names and last names in the `employees` table.

These SQL queries illustrate how to use `DISTINCT` to retrieve unique values or combinations and `COUNT DISTINCT` to count the number of unique values or combinations in a table. These operations are valuable for data analysis and reporting when you want to work with distinct elements within your dataset.

## LIKE & ILIKE
**1. LIKE:**

The LIKE operator is case-sensitive, meaning it distinguishes between uppercase and lowercase characters.
It's used to match text values based on patterns using wildcard characters:
%: Matches any sequence of characters (including no characters).
_: Matches any single character.
For example, column_name LIKE 'abc%' would match values starting with 'abc', such as 'abc123' or 'abcxyz'.

**2. ILIKE:**

The ILIKE operator is case-insensitive, meaning it does not distinguish between uppercase and lowercase characters.
It's used to perform a case-insensitive pattern match.
It also uses wildcard characters % and _, just like LIKE.
For example, column_name ILIKE 'abc%' would match values starting with 'abc' regardless of case, such as 'abc123', 'ABCXYZ', or 'aBc456'.

**Examples:**

Suppose you have a table called "Products" with a "Product_Name" column, and you want to retrieve products that have names starting with "apple" (case-insensitive):

```sql
-- Using ILIKE (case-insensitive)
SELECT * FROM Products
WHERE Product_Name ILIKE 'apple%';

-- Using LIKE (case-sensitive)
SELECT * FROM Products
WHERE Product_Name LIKE 'apple%';
```

## `JOINS`

In SQL, you can use `INNER JOIN` and `OUTER JOIN`, including `LEFT JOIN`, `RIGHT JOIN`, and `FULL JOIN`, to combine data from multiple tables based on a related column. Here are explanations of when and where to use them, along with code examples:

1. **INNER JOIN**:
   - Use `INNER JOIN` when you want to retrieve only the rows that have matching values in both tables.
   - It returns the intersection of the two tables, filtering out non-matching rows.
   - Example:

   ```sql
   SELECT orders.order_id, customers.customer_name
   FROM orders
   INNER JOIN customers ON orders.customer_id = customers.customer_id;
   ```

   In this query, only orders with matching customer IDs from both the `orders` and `customers` tables are returned.

2. **LEFT JOIN (OUTER JOIN)**:
   - Use `LEFT JOIN` when you want to retrieve all rows from the left table and the matching rows from the right table. If there's no match in the right table, it returns null values.
   - It ensures that all rows from the left table are included in the result.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   LEFT JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all customers are listed, and their orders are included if they have any. If a customer has no orders, null values will be shown for the `order_id`.

3. **RIGHT JOIN (OUTER JOIN)**:
   - Use `RIGHT JOIN` when you want to retrieve all rows from the right table and the matching rows from the left table. If there's no match in the left table, it returns null values.
   - It ensures that all rows from the right table are included in the result.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   RIGHT JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all orders are listed, and the corresponding customer names are included if they exist. If there's no matching customer, null values will be shown for the `customer_name`.

4. **FULL JOIN (OUTER JOIN)**:
   - Use `FULL JOIN` when you want to retrieve all rows from both tables, with null values in places where there are no matches.
   - It returns the union of the two tables, ensuring that all rows from both tables are included.
   - Example:

   ```sql
   SELECT customers.customer_name, orders.order_id
   FROM customers
   FULL JOIN orders ON customers.customer_id = orders.customer_id;
   ```

   In this query, all customers and all orders are listed, with null values in places where there are no matches.

The choice between `INNER JOIN` and `OUTER JOIN` depends on your specific requirements. Use `INNER JOIN` when you want only matching rows, and use `OUTER JOIN` (e.g., `LEFT JOIN`, `RIGHT JOIN`, or `FULL JOIN`) when you want to include non-matching rows with null values.

## `STRING` & `TIME CONVERSIONS`

In SQL, you can perform string and time conversions using various functions depending on the database system you are using. Below are some common SQL operations for string and time conversions with code examples:

**String Conversions:**

1. **CAST/CONVERT**: To convert a non-string data type (e.g., date, number) into a string:

   ```sql
   -- Using CAST
   SELECT CAST(some_integer AS VARCHAR) AS string_column
   FROM your_table;

   -- Using CONVERT (SQL Server)
   SELECT CONVERT(VARCHAR, some_date, 120) AS string_date
   FROM your_table;
   ```

2. **CONCATENATION**: To concatenate strings together:

   ```sql
   -- Using CONCAT
   SELECT CONCAT(first_name, ' ', last_name) AS full_name
   FROM employees;
   ```

3. **SUBSTRING**: To extract part of a string:

   ```sql
   SELECT SUBSTRING(column_name, start_position, length) AS extracted_string
   FROM your_table;
   ```

**Time Conversions:**

1. **TO_DATE/TO_TIMESTAMP (Database-dependent)**: To convert a string to a date or timestamp:

   ```sql
   -- PostgreSQL
   SELECT TO_DATE('2023-08-22', 'YYYY-MM-DD') AS date_column
   FROM your_table;

   -- Oracle
   SELECT TO_DATE('2023-08-22', 'YYYY-MM-DD') AS date_column
   FROM your_table;

   -- SQL Server
   SELECT CONVERT(DATETIME, '2023-08-22', 120) AS date_column
   FROM your_table;
   ```

2. **DATE_FORMAT/TO_CHAR (Database-dependent)**: To format a date or timestamp as a string:

   ```sql
   -- MySQL
   SELECT DATE_FORMAT(some_date, '%Y-%m-%d') AS formatted_date
   FROM your_table;

   -- PostgreSQL
   SELECT TO_CHAR(some_date, 'YYYY-MM-DD') AS formatted_date
   FROM your_table;

   -- Oracle
   SELECT TO_CHAR(some_date, 'YYYY-MM-DD') AS formatted_date
   FROM your_table;

   -- SQL Server
   SELECT CONVERT(VARCHAR, some_date, 120) AS formatted_date
   FROM your_table;
   ```

These examples demonstrate how to perform common string and time conversions in SQL. The specific functions and syntax may vary depending on the database system you are using, so make sure to refer to your database's documentation for exact details.

## `UNION`

In SQL, both `UNION` and `UNION ALL` are used to combine the results of two or more `SELECT` queries into a single result set. However, there is a key difference between them:

- `UNION`: Removes duplicate rows from the result set, ensuring that only distinct rows are included in the final result.
- `UNION ALL`: Includes all rows from the result sets, including duplicates. It does not remove duplicate rows.

Here are code examples illustrating the use of both `UNION` and `UNION ALL`:

Assume we have two tables: `customers` and `vendors`, and we want to retrieve a list of unique names from both tables.

**Using UNION (Removing Duplicates):**

```sql
-- Retrieve unique customer names and vendor names
SELECT customer_name
FROM customers
UNION
SELECT vendor_name
FROM vendors;
```

In this example, the `UNION` operator combines the results of the two `SELECT` statements and removes duplicate names, so the result will contain only distinct names.

**Using UNION ALL (Including Duplicates):**

```sql
-- Retrieve all customer names and vendor names, including duplicates
SELECT customer_name
FROM customers
UNION ALL
SELECT vendor_name
FROM vendors;
```

In this example, we use `UNION ALL`, which combines the results of the two `SELECT` statements without removing duplicates. So, if there are duplicate names between customers and vendors, they will be included multiple times in the result.

Choose between `UNION` and `UNION ALL` based on your specific requirements. Use `UNION` when you want to retrieve distinct values and `UNION ALL` when you want to include all values, including duplicates, in the final result set.

## `HANDLING NULL VALUES`

Handling NULL values creatively in SQL often involves using functions like `COALESCE`, `CASE`, or `IS NULL` conditions. Here are some code examples to demonstrate creative ways of dealing with NULLs:

**Using COALESCE:**

Suppose you have a table `employees` with columns `first_name`, `last_name`, and `middle_name`, and some employees have a middle name while others do not. You want to display their full names creatively by handling NULL middle names:

```sql
SELECT
    first_name || ' ' || COALESCE(middle_name, '') || ' ' || last_name AS full_name
FROM
    employees;
```

In this example, `COALESCE` is used to replace NULL middle names with an empty string to ensure that the full name is displayed correctly for all employees.

**Using CASE:**

Suppose you have a table `orders` with columns `order_id`, `order_date`, and `ship_date`, and you want to categorize orders as either "On Time" or "Delayed" based on whether the `ship_date` is NULL or not:

```sql
SELECT
    order_id,
    order_date,
    ship_date,
    CASE
        WHEN ship_date IS NULL THEN 'Delayed'
        ELSE 'On Time'
    END AS order_status
FROM
    orders;
```

In this example, a `CASE` statement is used to creatively determine the order status based on the presence or absence of a `ship_date`.

**Using IS NULL:**

Suppose you have a table `inventory` with columns `product_id`, `product_name`, and `expiry_date`, and you want to identify products that have expired or those with no expiry date:

```sql
SELECT
    product_id,
    product_name,
    expiry_date,
    CASE
        WHEN expiry_date IS NULL THEN 'No Expiry Date'
        WHEN expiry_date < CURRENT_DATE THEN 'Expired'
        ELSE 'Not Expired'
    END AS expiry_status
FROM
    inventory;
```

In this example, the `IS NULL` condition is creatively used to identify products with no expiry date, and a `CASE` statement is used to determine whether a product is expired or not based on the expiry date.

These examples demonstrate creative ways to handle NULL values in SQL using functions like `COALESCE`, `CASE`, and `IS NULL`, allowing you to produce meaningful and informative query results.